{"url": "https://yournewswire.com/cnn-ratings-plunge-30-percent/", "text": "Jordan Poole +300 To Win NBA Sixth Man Of The Year\n\nPublished: October 10, 2022\n\nAuthor: Dustin Williams\n\nLast Updated: October 11, 2022\n\n\n\nIf you performed a Google search for Jordan Poole at this moment in time, his basketball skills and highlights will be pretty low on your immediate results.\n\nAll of the discussion around Poole is fixated on his recent altercation with teammate Draymond Green, in which Green struck Poole in the face during a recent practise session.\n\nThe 23-year-old enjoyed a true breakout year last season, averaging 18.5 points per game — a total only bettered by Steph Curry and Klay Thompson. In the Playoffs, Poole averaged 17 points per game and played a key role as the Warriors won their fourth NBA championship in eight years.\n\nThe impact Green’s unprovoked attack will have on the Warriors this year in their defense of the title remains to be seen. The power forward is currently away from the team after coming to a mutual agreement that he would stay away for the forseeable future.\n\nMany NBA betting sites have the Warriors as the favourites to win the Western Conference and NBA Championship this season, but the dynamic could change following this recent scandal. Green is in the final year of his contract with the Warriors and is looking for the last big deal of his career; something the franchise may not be inclined to reward him with following this latest bout of indiscipline.\n\nA trade could still be on the cards, but it appears that the Warriors are committed to building around Poole in the future. “There’s a reason he’s in this position, about to sign a big (contract) extension – hopefully,” said coach Steve Kerr after his first preseason appearance since the debacle. “The guy is tough. He’s mentally tough. He’s physically tough. He’s ultra-confident in his game, and he showed it tonight.”\n\nOne of the best betting sites, SportsBetting.ag, currently have Poole as the favorite to win the NBA Sixth Man of the Year award this season. Shooting guards have won this award in 16 of the last 18 seasons in the NBA, with bucket getters being the profile of player that the voters tend to go for.\n\nThe reigning Sixth Man of the Year, Tyler Herro, is a similar profile of player to Poole and both players are anticipated to sign comparible extensions with the franchises that drafted them in 2019. However, Herro has dropped to +1200 to retain his crown after he started during his only appearance in Miami’s preseason schedule.\n\nPoole was ruled out of the running for Sixth Man of the Year last year after starting too many games to match the criteria due to Thompson’s injury. Now that one half of the splash brothers is back healthy, Poole should return to his place as the first man of the bench while Thompson and Andrew Wiggins occupy the wing positions.\n\nLet’s also not forget narrative in all of this. Many NBA awards are won based on the narrative surrounding a player’s season, and as much as Poole wouldn’t have wanted this incident to happen, it will almost certainly lead to support in his corner.\n\nFull NBA Sixth Man of the Year Odds", "images": ["https://yournewswire.com/wp-content/uploads/sites/54/2022/10/Poole-2.jpeg", "https://yournewswire.com/wp-content/themes/joints-wp-master/assets/images/blank.gif"], "top_img": "https://yournewswire.com/wp-content/uploads/sites/54/2022/10/Poole-2.jpeg", "keywords": [], "authors": [], "canonical_link": "https://yournewswire.com/jordan-poole-300-to-win-nba-sixth-man-of-the-year", "title": "Jordan Poole +300 To Win NBA Sixth Man Of The Year", "meta_data": {"viewport": "width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimal-ui", "description": "If you performed a Google search for Jordan Poole at this moment in time, his basketball skills and highlights will be pretty low on your immediate results.", "robots": "index, follow, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_GB", "type": "article", "title": "Jordan Poole +300 To Win NBA Sixth Man Of The Year - yournewswire", "description": "If you performed a Google search for Jordan Poole at this moment in time, his basketball skills and highlights will be pretty low on your immediate results.", "url": "https://yournewswire.com/jordan-poole-300-to-win-nba-sixth-man-of-the-year", "site_name": "yournewswire", "updated_time": "2022-10-11T07:35:47+00:00", "image": {"identifier": "https://yournewswire.com/wp-content/uploads/sites/54/2022/10/Poole-2.jpeg", "secure_url": "https://yournewswire.com/wp-content/uploads/sites/54/2022/10/Poole-2.jpeg", "width": 800, "height": 400, "alt": "Jordan Poole +300 To Win NBA Sixth Man Of The Year", "type": "image/jpeg"}}, "article": {"section": "General News", "published_time": "2022-10-10T15:09:23+00:00", "modified_time": "2022-10-11T07:35:47+00:00"}, "twitter": {"card": "summary_large_image", "title": "Jordan Poole +300 To Win NBA Sixth Man Of The Year - yournewswire", "description": "If you performed a Google search for Jordan Poole at this moment in time, his basketball skills and highlights will be pretty low on your immediate results.", "image": "https://yournewswire.com/wp-content/uploads/sites/54/2022/10/Poole-2.jpeg", "label1": "Written by", "data1": "Dustin Williams", "label2": "Time to read", "data2": "2 minutes"}, "msapplication-TileImage": "https://yournewswire.com/wp-content/uploads/sites/54/2024/08/cropped-cropped-ImportedPhoto.739916748.369245-270x270.png"}, "movies": [], "publish_date": 1665414563.0, "source": "https://yournewswire.com", "summary": ""}