{"url": "http://nobelprize.org/nobel_prizes/peace/laureates/", "text": "The Nobel Peace Prize has been awarded 105 times to 142 Nobel Prize laureates between 1901 and 2024, 111 individuals and 31 organisations. Since the International Committee of the Red Cross has been awarded the Nobel Peace Prize three times (in 1917, 1944 and 1963), and the Office of the United Nations High Commissioner for Refugees has been awarded the Nobel Peace Prize two times (in 1954 and 1981), there are 28 individual organisations which have been awarded the Nobel Peace Prize. Click on the links to get more information.\n\nAll Categories Physics Chemistry Physiology or Medicine Literature Peace Economic Sciences 2024 - 2020 2019 - 2010 2009 - 2000 1999 - 1990 1989 - 1980 1979 - 1970 1969 - 1960 1959 - 1950 1949 - 1940 1939 - 1930 1929 - 1920 1919 - 1910 1909 - 1901 All Years The Nobel Peace Prize 2024 “for its efforts to achieve a world free of nuclear weapons and for demonstrating through witness testimony that nuclear weapons must never be used again” The Nobel Peace Prize 2023 “for her fight against the oppression of women in Iran and her fight to promote human rights and freedom for all” The Nobel Peace Prize 2022 “The Peace Prize laureates represent civil society in their home countries. They have for many years promoted the right to criticise power and protect the fundamental rights of citizens. They have made an outstanding effort to document war crimes, human right abuses and the abuse of power. Together they demonstrate the significance of civil society for peace and democracy” The Nobel Peace Prize 2021 “for their efforts to safeguard freedom of expression, which is a precondition for democracy and lasting peace” The Nobel Peace Prize 2020 “for its efforts to combat hunger, for its contribution to bettering conditions for peace in conflict-affected areas and for acting as a driving force in efforts to prevent the use of hunger as a weapon of war and conflict” Load more", "images": ["https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg"], "top_img": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nobelprize.org/prizes/lists/all-nobel-peace-prizes", "title": "All Nobel Peace Prizes", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "website", "site_name": "NobelPrize.org", "title": "All Nobel Peace Prizes", "description": "All Nobel Peace Prizes", "image": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg", "url": "https://www.nobelprize.org/prizes/lists/all-nobel-peace-prizes"}, "twitter": {"card": "summary_large_image", "title": "All Nobel Peace Prizes", "description": "All Nobel Peace Prizes", "image": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg"}, "msapplication-TileImage": "https://www.nobelprize.org/uploads/2018/08/Nobel-favicon.png"}, "movies": [], "publish_date": null, "source": "http://nobelprize.org", "summary": ""}