{"url": "www.firstpost.com/entertainment/watch-daniel-day-lewis-retires-from-acting-why-fans-shouldnt-consider-it-a-great-tragedy-3730703.html", "text": "Daniel Day-Lewis was never really a part of cinema for us to miss him. His purpose was much larger.\n\nThe term ‘greatest’ has been used by just about everyone when it comes to Daniel Day-Lewis, right from the time the three-time Oscar winner burst upon the scene.\n\nPerhaps that is the reason why anytime Daniel Day-Lewis announces anything it is met with reverence reserved for the gods - be it his silent disappearance from the scene following the release of his film Boxer (1999) or his ‘return’ to acting with Martin Scorsese’s Gangs of New York (2002) or the way he told a close few friends that he was off to Dublin post-Lincoln (2012), his last completed film.\n\nAdvertisement\n\nAs expected then the news of him announcing his retirement from acting has evoked a similar response and considering the reaction, perhaps the world is not going to be same again.\n\nGreat as his acting is and brilliant as he may be when it comes to preparing for a role, Daniel Day-Lewis leaving acting is not as great a tragedy as some would like us to believe.\n\nThe thing that probably makes Day-Lewis one of the most preeminent actors of our times, in not just his craft but also the way his craft touches the audiences. He’s known to fully immerse himself in the character that he is playing to an unbelievable degree. To say that Day-Lewis is merely acting for the camera while in a film would be an understatement.\n\nDuring the making of My Left Foot he famously remained in character, as the writer with cerebral palsy, to the extent that he was spoon-fed by the crew. For In the Name of the Father (1993) he slept in an abandoned jail and ate only prison rations. For The Crucible (1996), he lived in the film set’s replica village without electricity or running water and built his character’s house with 17th-century tools and most famously for Gangs of New York he trained as a butcher, caught pneumonia while on set after effusing to change his threadbare coat for a warmer one because it hadn’t existed in the 19th century and even wandered about Rome (where Gangs was filmed) in character, fighting strangers.\n\nAdvertisement\n\nThere is a ‘great’ Daniel Day-Lewis preparation for every decade from the 1990s till the 2010s and these roles have been acknowledged by the biggest honour possible for any actor - an Academy Award.\n\nHe won his second and third Oscar for There Will Be Blood (2007) and Lincoln (2012) respectively and was nominated for In the of the Father and Gangs of New York. The emotional excessiveness that Day-Lewis’ performances display has connected with audiences consistently for the last three decades and therefore watching him become a character has almost become the gold standard.\n\nAdvertisement\n\nFor most film fans watching an actor trained in the Method, a style where the artist is supposed to delve deep into his or her own consciousness and allow one’s self to ‘become’ the character, has held great fascination since Marlon Brando made it fashionable in the late 1940s.\n\nThe sheer effort that Day-Lewis puts in by itself becomes enough for any ‘Daniel Day-Lewis’ performance to be considered great. You knew that The Last of the Mohicans (1992) was the real thing because the Hawkeye (Daniel Day-Lewis) you saw on the screen actually lived off the land for six months, trained how to track and skin animals.\n\nAdvertisement\n\nSimilarly, to prepare for There Will Be Blood Day-Lewis insisted on living in a tent on an abandoned Texas oilfield and therefore he could interpret the feelings and the emotions of the late twentieth-century oil prospector, Daniel Plainview, to perfection. It is hardly surprising then that it was enough for Day-Lewis to show up in order to be judged best actor at most award functions.\n\nAdvertisement\n\nYet watching Day-Lewis play a character can also be a boring affair.\n\nAdvertisement\n\nUnless some great co-stars accompany him such as Joan Allen in The Crucible or a well-cast Michelle Pfeiffer with Winona Ryder in The Age of Innocence (1993), Day-Lewis, at times, seems to be acting in a vacuum. See him in the scenes with Leonardo Di Caprio in The Gangs of New York or next to Tommy Lee Jones in Lincoln and you notice how most of the times his co-stars look as if they are waiting for him to get done.\n\nThere are times when his acting overburdens the very film such as Lincoln where some critics couldn’t help but mention that despite being immaculately acted (largely by Day-Lewis, of course) it was a terribly dull film. Day-Lewis cannot be blamed if a film falls short of meeting his ‘expectations’ but the places where he doesn’t have anything gargantuan to bite into (say the musical Nine [2009> or The Ballad of Jack & Rose [2005>) he can be insipid.\n\nAdvertisement\n\nIn the end, the reality of not watching another Daniel Day-Lewis performance after Phantom Thread, his ‘last’ film that releases later this year, can be a matter of sadness for anyone who has ever enjoyed a film ever. But at the same time, Day-Lewis was never really there for us to miss him. Actors quit for a host of reasons and then also make a comeback but the chances of Day-Lewis being coaxed into facing the camera ever again are perhaps actually low.\n\nAdvertisement\n\nIn an interview, he once mentioned that letting go of the characters he has so lovingly created is a hard thing and added, “ when you’ve been someone else for that amount of time, it’s even more absurd when it’s all over .” Perhaps Day-Lewis’ insane, overblown preparations somewhere allowed him to be what he couldn’t be in real life and once you become someone else being yourself can be a boring affair.\n\nAdvertisement\n\nAre there then no other people left for him to be that he decided to quit at 60, an age when many other great actors have hit a golden phase of their career? Or could it be that he never wants the preparation for a role to end and only ‘retirement’ offers him the solace of being in character forever?", "images": ["https://images.firstpost.com/dlxczavtqcctuei/news18/static/images/fp/firstpost-logo.png", "https://images.firstpost.com/wp-content/uploads/2019/10/Colorado-Shooting-Joker-Movie.jpg?im=FitAndFill=(156,87)", "https://images.firstpost.com/dlxczavtqcctuei/news18/static/images/fp/firstpost-desktop.png", "https://images.firstpost.com/wp-content/uploads/2019/10/Colorado-Shooting-Joker-Movie.jpg?im=FitAndFill=(284,159)", "https://images.firstpost.com/wp-content/uploads/2020/09/Lincoln-640.jpg?im=FitAndFill=(284,159)", "https://media.nw18.com/media-assets/wbx6pq/02-2024/16-2024/4h3ocOiQst-Homepage-Carousel-Banner---BTLMobile-156x156jpg-28jnr5hL8Z.jpg?impolicy=website&width=134&height=134", "https://media.nw18.com/media-assets/wbx6pq/02-2024/17-2024/WUH7b65G7g-First-Sports-3-1png-RIRFelWGi0.png?impolicy=website&width=134&height=134", "https://images.firstpost.com/wp-content/uploads/2022/03/pta-640.jpg?im=FitAndFill=(156,87)", "https://media.nw18.com/media-assets/wbx6pq/02-2024/16-2024/2mVlWbMS5r-VANTAGE-Mobile-156x156jpg-gwRotnmLXQ.jpg?impolicy=website&width=134&height=134", "https://images.firstpost.com/wp-content/uploads/2020/09/Lincoln-640.jpg?im=FitAndFill=(156,87)", "https://images.firstpost.com/wp-content/uploads/2022/03/pta-640.jpg?im=FitAndFill=(284,159)", "https://images.firstpost.com/wp-content/uploads/2017/06/daniel-day-lewis.jpg?im=FitAndFill=(1200,675)", "https://images.firstpost.com/wp-content/uploads/large_file_plugin/2020/05/1588909418_billclintonF.jpg?im=FitAndFill=(284,159)", "https://images.firstpost.com/wp-content/uploads/large_file_plugin/2020/05/1588909418_billclintonF.jpg?im=FitAndFill=(156,87)", "https://images.news18.com/dlxczavtqcctuei/news18/static/images/fp/yt-channel.png", "https://media.nw18.com/media-assets/wbx6pq/02-2024/16-2024/QBPcjiVLCN-FNF-156x156jpg-wzgb4mCpih.jpg?impolicy=website&width=134&height=134", "https://images.firstpost.com/dlxczavtqcctuei/news18/static/images/fp/fp-logo.png", "https://images.firstpost.com/wp-content/uploads/2017/06/daniel-day-lewis.jpg?im=FitAndFill=(596,336)", "https://images.news18.com/dlxczavtqcctuei/news18/static/images/fp/fp-logo-sm.jpg"], "top_img": "https://images.firstpost.com/wp-content/uploads/2017/06/daniel-day-lewis.jpg?im=FitAndFill=(1200,675)", "keywords": [], "authors": [], "canonical_link": "https://www.firstpost.com/entertainment/watch-daniel-day-lewis-retires-from-acting-why-fans-shouldnt-consider-it-a-great-tragedy-3730703.html", "title": "Daniel Day-Lewis retires from acting: Why fans shouldn't consider it a great tragedy", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "description": "Daniel Day-Lewis was never really a part of cinema for us to miss him. His purpose was much larger.", "robots": "max-image-preview:large", "keywords": "Daniel Day Lewis,Lincoln,There Will Be Blood", "news_keywords": "Daniel Day Lewis, Lincoln, There Will Be Blood", "og": {"title": "Daniel Day-Lewis retires from acting: Why fans shouldn't consider it a great tragedy", "description": "Daniel Day-Lewis was never really a part of cinema for us to miss him. His purpose was much larger.", "type": "article", "url": "https://www.firstpost.com/entertainment/watch-daniel-day-lewis-retires-from-acting-why-fans-shouldnt-consider-it-a-great-tragedy-3730703.html", "image": {"identifier": "https://images.firstpost.com/wp-content/uploads/2017/06/daniel-day-lewis.jpg?im=FitAndFill=(1200,675)", "width": 1200, "height": 675}, "category": "entertainment", "locale": "fp_IN", "site_name": "Firstpost"}, "fb": {"pages": 122176787772, "app_id": 964288731082630}, "article": {"section": "entertainment", "published_time": "2017-06-21T16:45:24+05:30", "modified_time": "2017-06-23T19:02:53+05:30"}, "twitter": {"card": "summary_large_image", "image": "https://images.firstpost.com/wp-content/uploads/2017/06/daniel-day-lewis.jpg?im=FitAndFill=(1200,675)", "title": "Daniel Day-Lewis retires from acting: Why fans shouldn't consider it a great tragedy", "description": "Daniel Day-Lewis was never really a part of cinema for us to miss him. His purpose was much larger.", "site": "@Firstpost", "url": "https://www.firstpost.com/entertainment/watch-daniel-day-lewis-retires-from-acting-why-fans-shouldnt-consider-it-a-great-tragedy-3730703.html"}}, "movies": [], "publish_date": 1498043724.0, "source": "http://www.firstpost.com", "summary": ""}