{"url": "yournewswire.com/keanu-reeves-bitcoin-new-world-order/", "text": "First US Sports Betting Exchange Opens In New Jersey\n\nPublished: August 30, 2022\n\nAuthor: Dustin Williams\n\nLast Updated: August 30, 2022\n\n\n\nThe first-ever US sports betting exchange has launched this week as American sports bettors are introduced to exchange betting.\n\nThe peer-to-peer betting service, Prophet Exchange, will be the first of its kind in the US and was founded in 2018 by CEO Dean Sisun and COO Jake Benzapuen. For those who don’t know, exchange betting platforms act as the middle man in any wager placed using their service and only accept fixed rate commissions from winnings.\n\nUnder this concept, users themselves are allowed to set their own prices on bets, or place wagers on prices that have been set already by other users of the site. Doing the former is known as ‘backing’ a selection, while the latter is ‘laying’ a selection.\n\nProphet Exchange set no limits on any of the wagers that are placed on their site either, so long as customers have an outside party to match their bet.\n\nYou will be able to bet on NFL, NBA, NHL, MLB, NCAA Football and NCAA Basketball games to start with on moneyline, spread and totals markets. The number of sports and markets will continue to expand in line with the growth of the platform.\n\nFormer New York Giants wide receiver Victor Cruz has taken on the role of advisor and became the first person to use Prophet Exchange when he matched two bets. One was $100 on the New York Giants +5.5 against the Tennessee Titans at +100 in Week 1 of the upcoming NFL season, with the other being the Giants on the moneyline at +230.\n\n“Prophet Exchange is the sports betting platform of the future,” said Cruz. “It was great to place a bet directly with other users on the exchange without having to factor in lines that oddsmakers chose. I’m extremely proud to be a strategic partner of Prophet Exchange as they continue to innovate the sports betting world. Being a native of New Jersey, there’s no company I’d rather partner with. Of course, I had to bet on my Giants for my first wager.”\n\n”There is an overwhelming amount of emotion I feel for Prophet officially launching as the first fully regulated, peer to peer betting exchange in New Jersey,” said co-founder and CEO Sisun. “This has been a monumentally challenging journey to date, and to see it come to life is an amazing achievement for our team. That being said, this is only Prophet’s first major milestone, and we will not lose sight of our north star: becoming the mainstream sports betting platform in the United States.”\n\n“Launching here in New Jersey is everything we’ve been working towards for four years,” added co-founder and COO Benzaquen. “Being the first start-up and the first betting exchange in the United States regulated market means the world to us and our team here in Hoboken, and globally. We cannot wait to show the public who we are and what our product offers to the market here in New Jersey and beyond. As we say here, to the moon.”\n\nProphet Exchange will initially only open in New Jersey and will also be live in Indiana. They plan to venture into additional states over the course of 2023.", "images": ["https://yournewswire.com/wp-content/uploads/sites/54/2022/08/prophet-exchange.jpeg", "http://yournewswire.com/wp-content/themes/joints-wp-master/assets/images/blank.gif"], "top_img": "https://yournewswire.com/wp-content/uploads/sites/54/2022/08/prophet-exchange.jpeg", "keywords": [], "authors": [], "canonical_link": "https://yournewswire.com/first-us-sports-betting-exchange-opens-in-new-jersey", "title": "First US Sports Betting Exchange Opens In New Jersey", "meta_data": {"viewport": "width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimal-ui", "description": "The first-ever US sports betting exchange has launched this week as American sports bettors are introduced to exchange betting.", "robots": "index, follow, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_GB", "type": "article", "title": "First US Sports Betting Exchange Opens In New Jersey - yournewswire", "description": "The first-ever US sports betting exchange has launched this week as American sports bettors are introduced to exchange betting.", "url": "https://yournewswire.com/first-us-sports-betting-exchange-opens-in-new-jersey", "site_name": "yournewswire", "updated_time": "2022-08-30T14:51:08+00:00", "image": {"identifier": "https://yournewswire.com/wp-content/uploads/sites/54/2022/08/prophet-exchange.jpeg", "secure_url": "https://yournewswire.com/wp-content/uploads/sites/54/2022/08/prophet-exchange.jpeg", "width": 1200, "height": 675, "alt": "Sports Betting Exchange", "type": "image/jpeg"}}, "article": {"section": "General News", "published_time": "2022-08-30T14:49:50+00:00", "modified_time": "2022-08-30T14:51:08+00:00"}, "twitter": {"card": "summary_large_image", "title": "First US Sports Betting Exchange Opens In New Jersey - yournewswire", "description": "The first-ever US sports betting exchange has launched this week as American sports bettors are introduced to exchange betting.", "image": "https://yournewswire.com/wp-content/uploads/sites/54/2022/08/prophet-exchange.jpeg", "label1": "Written by", "data1": "Dustin Williams", "label2": "Time to read", "data2": "2 minutes"}, "msapplication-TileImage": "https://yournewswire.com/wp-content/uploads/sites/54/2024/08/cropped-cropped-ImportedPhoto.739916748.369245-270x270.png"}, "movies": [], "publish_date": 1661870990.0, "source": "http://yournewswire.com", "summary": ""}