{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nWASHINGTON, D.C. (Nov. 12, 2024) – The NFIB Small Business Optimism Index rose by 2.2 points in October to 93.7. This is the 34th consecutive month below the 50-year average of 98. The Uncertainty Index rose seven points to 110, the highest reading recorded. A seasonally adjusted net negative 20% of small business owners reported higher nominal sales in the past three months, the lowest reading since July 2020.\n\n“With the election over, small business owners will begin to feel less uncertain about future business conditions,” said NFIB Chief Economist Bill Dunkelberg. “Although optimism is on the rise on Main Street, small business owners are still facing unprecedented economic adversity. Low sales, unfilled jobs openings, and ongoing inflationary pressures continue to challenge our Main Streets, but owners remain hopeful as they head toward the holiday season.”\n\nKey findings include:\n\nA net negative 20% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down three points from September and the lowest reading since July 2020.\n\nSeasonally adjusted, a net 31% reported raising compensation, down one point from September. The last time it was this low was April 2021.\n\nThe net percent of owners expecting higher real sales volumes rose five points to a net negative 4% (seasonally adjusted), the highest reading of this year.\n\nA net 5% of owners reported paying a higher rate on their most recent loan, down seven points from September and the lowest reading since January 2022.\n\nThirty-five percent (seasonally adjusted) of all owners reported job openings they could not fill in the current period, up one point from September.\n\nTwenty-three percent of owners reported that inflation was their single most important problem in operating their business (higher input and labor costs), unchanged from September and remaining the top issue.\n\nAs reported in NFIB’s monthly jobs report, a seasonally adjusted 35% of all small business owners reported job openings they could not fill in October, up one point from September’s lowest reading since January 2021. Of the 53% of owners hiring or trying to hire in October, 87% reported few or no qualified applicants for the positions they were trying to fill.\n\nFifty-four percent of owners reported capital outlays in the last six months, up three points from September. Of those making expenditures, 35% reported spending on new equipment, 23% acquired vehicles, and 14% improved or expanded facilities. Eleven percent spent money on new fixtures and furniture and 5% acquired new buildings or land for expansion. Twenty-two percent (seasonally adjusted) plan capital outlays in the next six months, up three points from September.\n\nA net negative 20% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down three points from September and the lowest reading since July 2020. The net percent of owners expecting higher real sales volumes rose five points to a net negative 4% (seasonally adjusted), the highest reading of this year.\n\nThe net percent of owners reporting inventory gains rose four points to a net negative 9%, seasonally adjusted. Not seasonally adjusted, 10% reported increases in stocks and 18% reported reductions.\n\nA net negative 2% (seasonally adjusted) of owners viewed current inventory stocks as “too low” in October, up two points from September. A net negative 2% (seasonally adjusted) of owners plan inventory investment in the coming months, up one point from September.\n\nThe net percent of owners raising average selling prices fell one point from September to a net 21% seasonally adjusted. Twenty-three percent of owners reported that inflation was their single most important problem in operating their business, unchanged from September and remaining the top issue. Unadjusted, 13% reported lower average selling prices and 32% reported higher average prices.\n\nPrice hikes were the most frequent in the finance (53% higher, 9% lower), retail (38% higher, 11% lower), construction (35% higher, 9% lower), and services (35% higher, 13% lower) sectors. Seasonally adjusted, a net 26% plan price hikes in October.\n\nSeasonally adjusted, a net 31% reported raising compensation, down one point from September. The last time it was this low was April 2021. A seasonally adjusted net 23% plan to raise compensation in the next three months, unchanged from September. Eight percent of owners cited labor costs as their top business problem, down one point from September and only five points below the highest reading of 13% reached in December 2021. Twenty percent said that labor quality was their top business problem, remaining behind inflation as the number one issue.\n\nThe frequency of reports of positive profit trends was a net negative 33% (seasonally adjusted), up one point from September. Among owners reporting lower profits, 39% blamed weaker sales, 16% blamed the rise in the cost of materials, 12% cited labor costs, and 7% cited lower selling prices. For owners reporting higher profits, 51% credited sales volumes, 13% cited usual seasonal change, and 13% cited higher selling prices.\n\nTwo percent of owners reported that all their borrowing needs were not satisfied. Twenty-three percent reported all credit needs met and 64% said they were not interested in a loan. A net 6% reported their last loan was harder to get than in previous attempts. Three percent of owners reported that financing was their top business problem in October, down one point from September.\n\nThe NFIB Research Center has collected Small Business Economic Trends data with quarterly surveys since the fourth quarter of 1973 and monthly surveys since 1986. Survey respondents are randomly drawn from NFIB’s membership. The report is released on the second Tuesday of each month. This survey was conducted in October 2024.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}